Revit 2024 API
FileOpenDialog Constructor
 Constructs a new instance of a File Open dialog.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public FileOpenDialog(
	string filter
)
Visual Basic
Public Sub New ( _
	filter As String _
)
Visual C++
public:
FileOpenDialog(
	String^ filter
)
Parameters
filter
Type: System.String
 The filter string. See the remarks for Filter for details.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The input filter string does not meet the minimal requirements for a valid filter string.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FileOpenDialog Class
Autodesk.Revit.UI Namespace